; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v5 ?v13)
             (pred_10 ?v6 ?v10)
             (pred_3 ?v5 ?v10)
             (pred_2 ?v9 ?v5 )
	     (pred_9 ?v5)
             (pred_1 ?v8)
             (pred_5 ?v6)
             (pred_11 ?v10)
             (pred_7 ?v5)
             (pred_8 ?v6)
             (pred_6 ?v5)
             (pred_12 ))



(:action op_4
:parameters (?v2 ?v4 ?v12 ?v1)
:precondition (and (pred_1 ?v2) (pred_1 ?v4) (pred_5 ?v12) (pred_11 ?v1)
          (pred_4 ?v2 ?v4) (pred_10 ?v12 ?v1)
                   (pred_3 ?v4 ?v1) (pred_9 ?v2) 
                   (pred_7 ?v4) (pred_8 ?v12))
:effect (and  (pred_6 ?v4) (not (pred_7 ?v4))))


(:action op_3
:parameters (?v2 ?v7)
:precondition (and (pred_1 ?v2) (pred_1 ?v7)
               (pred_9 ?v2) (pred_4 ?v2 ?v7) (pred_6 ?v7))
:effect (and (pred_9 ?v7) (not (pred_9 ?v2))))

(:action op_1
:parameters (?v2 ?v12)
:precondition (and (pred_1 ?v2) (pred_5 ?v12) 
                  (pred_9 ?v2) (pred_2 ?v12 ?v2) (pred_12 ))
:effect (and (pred_8 ?v12)
   (not (pred_2 ?v12 ?v2)) (not (pred_12 ))))


(:action op_2
:parameters (?v2 ?v11 ?v3)
:precondition (and (pred_1 ?v2) (pred_5 ?v11) (pred_5 ?v3)
                  (pred_9 ?v2) (pred_8 ?v3) (pred_2 ?v11 ?v2))
:effect (and (pred_8 ?v11) (pred_2 ?v3 ?v2)
        (not (pred_8 ?v3)) (not (pred_2 ?v11 ?v2))))

(:action op_5
:parameters (?v2 ?v12)
:precondition (and (pred_1 ?v2) (pred_5 ?v12) 
                  (pred_9 ?v2) (pred_8 ?v12))
:effect (and (pred_12 ) (pred_2 ?v12 ?v2) (not (pred_8 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_02 obj_07 obj_06 obj_09 obj_03 obj_11 obj_01 obj_10
    obj_05 obj_12
    obj_13 obj_08
    )

    (:init
       (pred_12)

       (pred_1 obj_04)
       (pred_1 obj_02)
       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_09)
       (pred_1 obj_03)
       (pred_1 obj_11)
       (pred_1 obj_01)
       (pred_1 obj_10)
       (pred_11 obj_05)
       (pred_11 obj_12)
       (pred_5 obj_13)
       (pred_5 obj_08)

       (pred_4 obj_04 obj_06)
       (pred_4 obj_04 obj_02)
       (pred_4 obj_02 obj_09)
       (pred_4 obj_02 obj_07)
       (pred_4 obj_02 obj_04)
       (pred_4 obj_07 obj_03)
       (pred_4 obj_07 obj_02)
       (pred_4 obj_06 obj_11)
       (pred_4 obj_06 obj_09)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_09 obj_01)
       (pred_4 obj_09 obj_03)
       (pred_4 obj_09 obj_02)
       (pred_4 obj_09 obj_06)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_03 obj_07)
       (pred_4 obj_03 obj_09)
       (pred_4 obj_11 obj_01)
       (pred_4 obj_11 obj_06)
       (pred_4 obj_01 obj_10)
       (pred_4 obj_01 obj_09)
       (pred_4 obj_01 obj_11)
       (pred_4 obj_10 obj_03)
       (pred_4 obj_10 obj_01)
       (pred_7 obj_06)
       (pred_7 obj_11)
       (pred_3  obj_06 obj_05)
       (pred_3  obj_11 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_09)
       (pred_6 obj_03)
       (pred_6 obj_01)
       (pred_6 obj_10)

       (pred_10  obj_13 obj_05)
       (pred_10  obj_08 obj_12)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_08 obj_06)
       (pred_9 obj_10)
    )

    (:goal (and
       (pred_2 obj_13 obj_07)
    ))
(:constraints
  (always (not (pred_9 obj_03)))
)
)

; plan
1. (op_1 obj_10 obj_13)
   deleted: (pred_2 obj_13 obj_10) (pred_12)
   added: (pred_8 obj_13)
   goals met: 0 of 1
2. (op_3 obj_10 obj_01)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_01)
   goals met: 0 of 1
3. (op_3 obj_01 obj_09)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_09)
   goals met: 0 of 1
4. (op_3 obj_09 obj_02)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_02)
   goals met: 0 of 1
5. (op_3 obj_02 obj_07)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_07)
   goals met: 0 of 1
6. (op_5 obj_07 obj_13)
   deleted: (pred_8 obj_13)
   added: (pred_12) (pred_2 obj_13 obj_07)
   goals met: 1 of 1
